# http://du.hanyupinyin.cn/shengdiao.html
def alphabet():

    py_char=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i','j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w','x','y','z',
    'ā', 'á', 'ǎ', 'à', 'ō', 'ó', 'ǒ', 'ò', 'ē', 'é', 'ě', 'è', 'ī', 'í', 'ǐ', 'ì', 'ū', 'ú', 'ǔ', 'ù', 'ǖ', 'ǘ', 'ǚ','ǜ']

    return py_char


    # ['a1','a2','a3','a4','e1','e2','e3','e4','e5','i1','i2','i3','i4','i5','o1','o2','o3','o4','o5','u1','u2','u3','u4','u5']
    # ['ā', 'á', 'ǎ', 'à', 'ō', 'ó', 'ǒ', 'ò', 'ē', 'é', 'ě', 'è', 'ī', 'í', 'ǐ', 'ì', 'ū', 'ú', 'ǔ', 'ù','ǖ','ǘ','ǚ','ǜ']
    # ['ǖ','ǘ','ǚ','ǜ']
    # py_char=['b', 'p', 'm', 'f', 'd', 't', 'n', 'l', 'g', 'k', 'h', 'j', 'q', 'x', 'zh', 'ch', 'sh', 'r', 'z', 'c', 's', 'y','w',
    #     #          'a', 'o', 'e', 'i', 'u', 'v', 'ai', 'ei', 'ui', 'ao', 'ou', 'iu', 'ie','ve','er','an','en','in','un','vn','ang','eng','ing','ong']


print(alphabet())
